import pandas as pd

df1 = pd.DataFrame({
    "Time": [0.0, 4.0, 8.0, 12.0, 16.0, 20.0, 24.0],
    "OpticalDensity": [0.088, 0.229, 0.6595, 0.949, 0.972, 1.0456, 1.023],
    "pH": [5.67, 5.41, 4.69, 4.23, 4.17, 4.01, 3.98],
    "Glucose": [20.0, 18.763, 14.526, 11.526, 10.231, 5.78, 4.2],
    "Protein": [10.25, 10.775, 11.15, 11.0, 10.9, 10.85, 10.5]
})

df2 = pd.DataFrame({
    "t, °C": [35.0, 37.0, 40.0, 45.0],
    "OpticalDensity": [1.025, 1.075, 1.035, 0.875]
})

df3 = pd.DataFrame({
    "Площа аерації (в пробірках), мм²": [154.0, 214.0, 517.0, 2289.0, 2826.0, 3017.5],
    "OpticalDensity": [0.9415, 0.9887, 0.944, 1.1235, 1.1724, 1.1933]
})

df4 = pd.DataFrame({
    "Кількість обертів качалки (об/хв)": [0.0, 50.0, 100.0, 150.0],
    "OpticalDensity": [0.8355, 1.056, 0.919, 0.81225]
})
