import pandas as pd

lb3_time_opticaldensity_ph_glucose_protein_37 = pd.DataFrame({
    "Time": [0.0, 4.0, 8.0, 12.0, 16.0, 20.0, 24.0],
    "OpticalDensity": [0.088, 0.229, 0.6595, 0.949, 0.972, 1.0456, 1.023],
    "pH": [5.67, 5.41, 4.69, 4.23, 4.17, 4.01, 3.98],
    "Glucose": [20.0, 18.763, 14.526, 11.526, 10.231, 5.78, 4.2],
    "Protein": [10.25, 10.775, 11.15, 11.0, 10.9, 10.85, 10.5]
})

le_time_opticaldensity_ph_glucose_protein_37 = pd.DataFrame({
    "Time": [0, 4, 8, 12, 16, 20, 24],
    "OpticalDensity": [0.0460, 0.1047, 0.2487, 0.4780, 0.4860, 0.5515, 0.4950],
    "pH": [5.7300, 5.6033, 5.2633, 4.7100, 4.6300, 4.4750, 4.6100],
    "Glucose": [20.0000, 19.6847, 18.4263, 16.2250, 15.3250, 9.6430, 5.9800],
    "Protein": [10.2500, 10.0167, 10.5333, 11.8000, 11.8500, 11.0000, 10.7000],
})

lb3_temperature = pd.DataFrame({
    "t, °C":          [35.0, 37.0, 40.0, 45.0],
    "OpticalDensity": [1.025, 1.075, 1.035, 0.875],
    "pH": [5.05, 4.645, 4.738, 4.953],
})

aeration_lb3_37 = pd.DataFrame({
    "Площа аерації (в пробірках), мм²": [154.0, 214.0, 517.0, 2289.0, 2826.0, 3017.5],
    "OpticalDensity": [0.9415, 0.9887, 0.944, 1.1235, 1.1724, 1.1933]
})

stirring_lb3_37 = pd.DataFrame({
    "Кількість обертів качалки (об/хв)": [0.0, 50.0, 100.0, 150.0],
    "OpticalDensity": [0.8355, 1.056, 0.919, 0.81225]
})
